---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointIterator.Free
source: html/c04152a8-d39b-a83c-78e8-af9b52c034ba.htm
---
# Autodesk.Revit.DB.PointClouds.PointIterator.Free Method

Completes lifetime of the iterator. Call it when done using the iterator.

## Syntax (C#)
```csharp
public void Free()
```